wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_timer.h
/* break parameter struct definitions */
typedef struct {
    uint32_t runoffstate;                                                           /*!< run mode off-state */
    uint32_t ideloffstate;                                                          /*!< idle mode off-state */
    uint32_t deadtime;                                                              /*!< dead time */
    uint32_t outputautostate;                                                       /*!< output automatic enable */
    uint32_t protectmode;                                                           /*!< complementary register protect control */
    uint32_t break0state;                                                           /*!< BREAK0 input enable */
    uint32_t break0filter;                                                          /*!< BREAK0 input filter */
    uint32_t break0polarity;                                                        /*!< BREAK0 input polarity */
    uint32_t break0lock;                                                            /*!< BREAK0 input lock */
    uint32_t break0release;                                                         /*!< BREAK0 input release */
    uint32_t break1state;                                                           /*!< BREAK1 input enable */
    uint32_t break1filter;                                                          /*!< BREAK1 input filter */
    uint32_t break1polarity;                                                        /*!< BREAK1 input polarity */
    uint32_t break1lock;                                                            /*!< BREAK1 input lock */
    uint32_t break1release;                                                         /*!< BREAK1 input release */
} timer_break_parameter_struct;

/* channel output parameter struct definitions */
typedef struct {
    uint16_t outputstate;                                                           /*!< channel output state */
    uint16_t outputnstate;                                                          /*!< channel complementary output state */
    uint16_t ocpolarity;                                                            /*!< channel output polarity */
    uint16_t ocnpolarity;                                                           /*!< channel complementary output polarity */
    uint16_t ocidlestate;                                                           /*!< idle state of channel output */
    uint16_t ocnidlestate;                                                          /*!< idle state of channel complementary output */
} timer_oc_parameter_struct;

/* multi mode channel output parameter struct definitions */
typedef struct {
    uint16_t outputmode;                                                            /*!< multi mode channel output mode selection */
    uint16_t outputstate;                                                           /*!< multi mode channel output state */
    uint16_t ocpolarity;                                                            /*!< multi mode channel output polarity */
} timer_omc_parameter_struct;

/* channel input parameter struct definitions */
typedef struct {
    uint16_t icpolarity;                                                            /*!< channel input polarity */
    uint16_t icselection;                                                           /*!< channel input mode selection */
    uint16_t icprescaler;                                                           /*!< channel input capture prescaler */
    uint16_t icfilter;                                                              /*!< channel input capture filter control */
} timer_ic_parameter_struct;

/* channel free complementary parameter struct definitions */
typedef struct {
    uint32_t freecomstate;                                                          /*!< free complementary channel protection enable */
    uint32_t runoffstate;                                                           /*!< run mode off-state */
    uint32_t ideloffstate;                                                          /*!< idle mode off-state */
    uint32_t deadtime;                                                              /*!< dead time */
} timer_free_complementary_parameter_struct;

/* define the TIMER bit position and its register index offset */
#define TIMER_REGIDX_BIT1(regidx, bitpos) (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define TIMER_REG_VAL1(timerx, offset)    (REG32((uint32_t)(timerx) + ((uint32_t)((uint32_t)(offset) & 0x0000FFFFU) >> 6U)))
#define TIMER_BIT_POS1(val)               ((uint32_t)(val) & 0x0000001FU)
#define TIMER_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22U) | (uint32_t)((bitpos2) << 16U)\
                                                              | (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos)))
#define TIMER_REG_VAL2(timerx, offset)       (REG32((timerx) + ((uint32_t)(offset) >> 22U)))
#define TIMER_BIT_POS2(val)                  (((uint32_t)(val) & 0x001F0000U) >> 16U)

/* register offset */
#define TIMER_DMAINTEN_REG_OFFSET                 ((uint32_t)0x0000000CU)                 /*!< DMAINTEN register offset */
#define TIMER_CHBRKCTL_REG_OFFSET                 ((uint32_t)0x000000ACU)                 /*!< CHBRKCTL register offset */
#define TIMER_INTF_REG_OFFSET                     ((uint32_t)0x00000010U)                 /*!< INTF register offset */
#define TIMER_CHBRKINTF_REG_OFFSET                ((uint32_t)0x000000B4U)                 /*!< CHBRKINTF register offset */

/* TIMER interrupt enable or disable */
typedef enum {
    /* interrupt in DMAINTEN register */
    TIMER_INT_UP                             = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 0U),     /*!< update interrupt */
    TIMER_INT_CH0                            = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 1U),     /*!< channel 0 capture or compare interrupt */
    TIMER_INT_CH1                            = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 2U),     /*!< channel 1 capture or compare interrupt */
    TIMER_INT_CH2                            = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 3U),     /*!< channel 2 capture or compare interrupt */
    TIMER_INT_CH3                            = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 4U),     /*!< channel 3 capture or compare interrupt */
    TIMER_INT_CMT                            = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 5U),     /*!< channel commutation interrupt flag */
    TIMER_INT_TRG                            = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 6U),     /*!< trigger interrupt */
    TIMER_INT_BRK                            = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 7U),     /*!< break interrupt */
    TIMER_INT_DECJ                           = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 16U),    /*!< quadrature decoder signal jump (the two signals jump at the same time) interrupt */
    TIMER_INT_DECDIS                         = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 17U),    /*!< quadrature decoder signal disconnection interrupt */
    TIMER_INT_MCH0                           = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 20U),    /*!< multi mode channel 0 capture or compare interrupt */
    TIMER_INT_MCH1                           = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 21U),    /*!< multi mode channel 1 capture or compare interrupt */
    TIMER_INT_MCH2                           = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 22U),    /*!< multi mode channel 2 capture or compare interrupt */
    TIMER_INT_MCH3                           = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 23U),    /*!< multi mode channel 3 capture or compare interrupt */
    TIMER_INT_CH0COMADD                      = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 28U),    /*!< channel 0 additional compare interrupt */
    TIMER_INT_CH1COMADD                      = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 29U),    /*!< channel 1 additional compare interrupt */
    TIMER_INT_CH2COMADD                      = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 30U),    /*!< channel 2 additional compare interrupt */
    TIMER_INT_CH3COMADD                      = TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 31U),    /*!< channel 3 additional compare interrupt */
    /* interrupt in CHBRKCTL register */
    TIMER_INT_CH0BRKM                        = TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 0U),     /*!< channel 0 BREAK multi-period interrupt */
    TIMER_INT_CH1BRKM                        = TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 1U),     /*!< channel 1 BREAK multi-period interrupt */
    TIMER_INT_CH2BRKM                        = TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 2U),     /*!< channel 2 BREAK multi-period interrupt */
    TIMER_INT_CH3BRKM                        = TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 3U),     /*!< channel 2 BREAK multi-period interrupt */
    TIMER_INT_CH0BRK                         = TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 8U),     /*!< channel 0 BREAK interrupt */
    TIMER_INT_CH1BRK                         = TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 9U),     /*!< channel 1 BREAK interrupt */
    TIMER_INT_CH2BRK                         = TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 10U),    /*!< channel 2 BREAK interrupt */
    TIMER_INT_CH3BRK                         = TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 11U),    /*!< channel 2 BREAK interrupt */
} timer_interrupt_enum;

/* TIMER interrupt flag */
typedef enum {
    /* interrupt flag in INTF register */
    TIMER_INT_FLAG_UP                             = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 0U, TIMER_INTF_REG_OFFSET, 0U),     /*!< update interrupt flag */
    TIMER_INT_FLAG_CH0                            = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 1U, TIMER_INTF_REG_OFFSET, 1U),     /*!< channel 0 capture or compare interrupt flag */
    TIMER_INT_FLAG_CH1                            = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 2U, TIMER_INTF_REG_OFFSET, 2U),     /*!< channel 1 capture or compare interrupt flag */
    TIMER_INT_FLAG_CH2                            = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 3U, TIMER_INTF_REG_OFFSET, 3U),     /*!< channel 2 capture or compare interrupt flag */
    TIMER_INT_FLAG_CH3                            = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 4U, TIMER_INTF_REG_OFFSET, 4U),     /*!< channel 3 capture or compare interrupt flag */
    TIMER_INT_FLAG_CMT                            = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 5U, TIMER_INTF_REG_OFFSET, 5U),     /*!< channel commutation interrupt flag */
    TIMER_INT_FLAG_TRG                            = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 6U, TIMER_INTF_REG_OFFSET, 6U),     /*!< trigger interrupt flag */
    TIMER_INT_FLAG_BRK0                           = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 7U, TIMER_INTF_REG_OFFSET, 7U),     /*!< BREAK0 interrupt flag */
    TIMER_INT_FLAG_BRK1                           = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 7U, TIMER_INTF_REG_OFFSET, 8U),     /*!< BREAK1 interrupt flag */
    TIMER_INT_FLAG_SYSB                           = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 7U, TIMER_INTF_REG_OFFSET, 13U),    /*!< system source break interrupt flag */
    TIMER_INT_FLAG_DECJ                           = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 16U, TIMER_INTF_REG_OFFSET, 16U),    /*!< quadrature decoder signal jump (the two signals jump at the same time) interrupt flag */
    TIMER_INT_FLAG_DECDIS                         = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 17U, TIMER_INTF_REG_OFFSET, 17U),    /*!< quadrature decoder signal disconnection interrupt flag */
    TIMER_INT_FLAG_MCH0                           = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 20U, TIMER_INTF_REG_OFFSET, 20U),    /*!< multi mode channel 0 capture or compare interrupt flag */
    TIMER_INT_FLAG_MCH1                           = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 21U, TIMER_INTF_REG_OFFSET, 21U),    /*!< multi mode channel 1 capture or compare interrupt flag */
    TIMER_INT_FLAG_MCH2                           = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 22U, TIMER_INTF_REG_OFFSET, 22U),    /*!< multi mode channel 2 capture or compare interrupt flag */
    TIMER_INT_FLAG_MCH3                           = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 23U, TIMER_INTF_REG_OFFSET, 23U),    /*!< multi mode channel 3 capture or compare interrupt flag */
    TIMER_INT_FLAG_CH0COMADD                      = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 28U, TIMER_INTF_REG_OFFSET, 28U),    /*!< channel 0 additional compare interrupt flag */
    TIMER_INT_FLAG_CH1COMADD                      = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 29U, TIMER_INTF_REG_OFFSET, 29U),    /*!< channel 1 additional compare interrupt flag */
    TIMER_INT_FLAG_CH2COMADD                      = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 30U, TIMER_INTF_REG_OFFSET, 30U),    /*!< channel 2 additional compare interrupt flag */
    TIMER_INT_FLAG_CH3COMADD                      = TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 31U, TIMER_INTF_REG_OFFSET, 31U),    /*!< channel 3 additional compare interrupt flag */
    /* interrupt flag in CHBRKINTF register */
    TIMER_INT_FLAG_CH0BRKM                        = TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 0U, TIMER_CHBRKINTF_REG_OFFSET, 0U),    /*!< channel 0 BREAK multi-period interrupt flag */
    TIMER_INT_FLAG_CH1BRKM                        = TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 1U, TIMER_CHBRKINTF_REG_OFFSET, 1U),    /*!< channel 1 BREAK multi-period interrupt flag */
    TIMER_INT_FLAG_CH2BRKM                        = TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 2U, TIMER_CHBRKINTF_REG_OFFSET, 2U),    /*!< channel 2 BREAK multi-period interrupt flag */
    TIMER_INT_FLAG_CH3BRKM                        = TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 3U, TIMER_CHBRKINTF_REG_OFFSET, 3U),    /*!< channel 2 BREAK multi-period interrupt flag */
    TIMER_INT_FLAG_CH0BRK                         = TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 8U, TIMER_CHBRKINTF_REG_OFFSET, 4U),    /*!< channel 0 BREAK interrupt flag */
    TIMER_INT_FLAG_CH1BRK                         = TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 9U, TIMER_CHBRKINTF_REG_OFFSET, 5U),    /*!< channel 1 BREAK interrupt flag */
    TIMER_INT_FLAG_CH2BRK                         = TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 10U, TIMER_CHBRKINTF_REG_OFFSET, 6U),    /*!< channel 2 BREAK interrupt flag */
    TIMER_INT_FLAG_CH3BRK                         = TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 11U, TIMER_CHBRKINTF_REG_OFFSET, 7U),    /*!< channel 2 BREAK interrupt flag */
} timer_interrupt_flag_enum;

/* TIMER flag */
typedef enum {
    /* flag in INTF register */
    TIMER_FLAG_UP                             = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 0U),     /*!< update interrupt flag */
    TIMER_FLAG_CH0                            = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 1U),     /*!< channel 0 capture or compare interrupt flag */
    TIMER_FLAG_CH1                            = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 2U),     /*!< channel 1 capture or compare interrupt flag */
    TIMER_FLAG_CH2                            = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 3U),     /*!< channel 2 capture or compare interrupt flag */
    TIMER_FLAG_CH3                            = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 4U),     /*!< channel 3 capture or compare interrupt flag */
    TIMER_FLAG_CMT                            = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 5U),     /*!< channel commutation interrupt flag */
    TIMER_FLAG_TRG                            = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 6U),     /*!< trigger interrupt flag */
    TIMER_FLAG_BRK0                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 7U),     /*!< BREAK0 interrupt flag */
    TIMER_FLAG_BRK1                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 8U),     /*!< BREAK1 interrupt flag */
    TIMER_FLAG_CH0O                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 9U),     /*!< channel 0 over capture flag */
    TIMER_FLAG_CH1O                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 10U),    /*!< channel 1 over capture flag */
    TIMER_FLAG_CH2O                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 11U),    /*!< channel 2 over capture flag */
    TIMER_FLAG_CH3O                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 12U),    /*!< channel 3 over capture flag */
    TIMER_FLAG_SYSB                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 13U),    /*!< system source break interrupt flag */
    TIMER_FLAG_DECJ                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 16U),    /*!< quadrature decoder signal jump (the two signals jump at the same time) interrupt flag */
    TIMER_FLAG_DECDIS                         = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 17U),    /*!< quadrature decoder signal disconnection interrupt flag */
    TIMER_FLAG_MCH0                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 20U),    /*!< multi mode channel 0 capture/compare interrupt flag */
    TIMER_FLAG_MCH1                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 21U),    /*!< multi mode channel 1 capture/compare interrupt flag */
    TIMER_FLAG_MCH2                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 22U),    /*!< multi mode channel 2 capture/compare interrupt flag */
    TIMER_FLAG_MCH3                           = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 23U),    /*!< multi mode channel 3 capture/compare interrupt flag */
    TIMER_FLAG_MCH0O                          = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 24U),    /*!< multi mode channel 0 over capture flag */
    TIMER_FLAG_MCH1O                          = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 25U),    /*!< multi mode channel 1 over capture flag */
    TIMER_FLAG_MCH2O                          = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 26U),    /*!< multi mode channel 2 over capture flag */
    TIMER_FLAG_MCH3O                          = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 27U),    /*!< multi mode channel 3 over capture flag */
    TIMER_FLAG_CH0COMADD                      = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 28U),    /*!< channel 0 additional compare interrupt flag */
    TIMER_FLAG_CH1COMADD                      = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 29U),    /*!< channel 1 additional compare interrupt flag */
    TIMER_FLAG_CH2COMADD                      = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 30U),    /*!< channel 2 additional compare interrupt flag */
    TIMER_FLAG_CH3COMADD                      = TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 31U),    /*!< channel 3 additional compare interrupt flag */
    /* flag in CHBRKINTF register */
    TIMER_FLAG_CH0BRKM                        = TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 0U),     /*!< channel 0 BREAK multi-period interrupt flag */
    TIMER_FLAG_CH1BRKM                        = TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 1U),     /*!< channel 1 BREAK multi-period interrupt flag */
    TIMER_FLAG_CH2BRKM                        = TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 2U),     /*!< channel 2 BREAK multi-period interrupt flag */
    TIMER_FLAG_CH3BRKM                        = TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 3U),     /*!< channel 3 BREAK multi-period interrupt flag */
    TIMER_FLAG_CH0BRK                         = TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 4U),     /*!< channel 0 BREAK interrupt flag */
    TIMER_FLAG_CH1BRK                         = TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 5U),     /*!< channel 1 BREAK interrupt flag */
    TIMER_FLAG_CH2BRK                         = TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 6U),     /*!< channel 2 BREAK interrupt flag */
    TIMER_FLAG_CH3BRK                         = TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 7U),     /*!< channel 3 BREAK interrupt flag */
} timer_flag_enum;

/* TIMER DMA source */
#define TIMER_DMA_UPD                       TIMER_DMAINTEN_UPDEN                    /*!< update DMA request */
#define TIMER_DMA_CH0D                      TIMER_DMAINTEN_CH0DEN                   /*!< channel 0 capture or compare DMA request */
#define TIMER_DMA_CH1D                      TIMER_DMAINTEN_CH1DEN                   /*!< channel 1 capture or compare DMA request */
#define TIMER_DMA_CH2D                      TIMER_DMAINTEN_CH2DEN                   /*!< channel 2 capture or compare DMA request */
#define TIMER_DMA_CH3D                      TIMER_DMAINTEN_CH3DEN                   /*!< channel 3 capture or compare DMA request */
#define TIMER_DMA_CMTD                      TIMER_DMAINTEN_CMTDEN                   /*!< commutation DMA request */
#define TIMER_DMA_TRGD                      TIMER_DMAINTEN_TRGDEN                   /*!< trigger DMA request */
#define TIMER_DMA_MCH0D                     TIMER_DMAINTEN_MCH0DEN                  /*!< multi mode channel 0 capture or compare DMA request */
#define TIMER_DMA_MCH1D                     TIMER_DMAINTEN_MCH1DEN                  /*!< multi mode channel 1 capture or compare DMA request */
#define TIMER_DMA_MCH2D                     TIMER_DMAINTEN_MCH2DEN                  /*!< multi mode channel 2 capture or compare DMA request */
#define TIMER_DMA_MCH3D                     TIMER_DMAINTEN_MCH3DEN                  /*!< multi mode channel 3 capture or compare DMA request */

